jingbaocheng/STM32_Motor_Control_Journey/07_Vision_XY_Integration/stm32/10_CAN_DualAxis_RTOS/Core/Src/system_control.c
    /*
     * A numerically correct but stale encoder value is NOT a valid interlock.
     * Camera trigger is allowed only while position feedback is current.
     */
    if (Motion_PositionIsFresh(motion) == 0U)
    {
        return 0U;
    }

    error =
        target_machine - Motion_GetMachinePosition(motion);

    if (error < 0)
    {
        error = -error;
    }

    return (error <= tolerance) ? 1U : 0U;
}

static uint8_t Camera_TargetAlreadyReached(
    MotionController_t *motion,
    int64_t target_machine)
{
    return Camera_TargetWithin(
        motion,
        target_machine,
        CAMERA_READY_SKIP_TOLERANCE);
}

static uint8_t Camera_AllTargetsVerified(void)
{
    if (!Camera_TargetWithin(
            home_x.motion,
            g_camera_ready_x_target,
            CAMERA_READY_VERIFY_TOLERANCE))
    {
        return 0U;
    }

    if ((g_camera_ready_y_enable != 0U) &&
        !Camera_TargetWithin(
            home_y.motion,
            g_camera_ready_y_target,
            CAMERA_READY_VERIFY_TOLERANCE))
    {
        return 0U;
    }

    return 1U;
}

static void System_StartCameraSettle(void)
{
    g_camera_ready = 0U;

    /* Never let a bad mechanical position reach the camera trigger. */
    if (Camera_AllTargetsVerified() == 0U)
    {
        System_EnterError();
        return;
    }

    system_state_tick = HAL_GetTick();
    system_state = SYS_CAMERA_SETTLE;
}


static void AxisHome_Init(
    AxisHomeCtx_t *ctx,
    MotionController_t *motion,
    HomeSensorFn_t sensor,
    int32_t dir_sign)
{
    ctx->motion = motion;
    ctx->sensor_triggered = sensor;
    ctx->dir_sign = dir_sign;

    ctx->stage = HOME_STAGE_FAST_START;
    ctx->home_start_tick = HAL_GetTick();
    ctx->next_move_tick = 0U;
    ctx->stable_start_tick = 0U;
    ctx->back_retry_count = 0U;
    ctx->release_retry_count = 0U;

    /*
     * Do not trust the first GPIO sample. The same raw level must remain
     * stable for HOME_SENSOR_DEBOUNCE_MS before the first Home motion starts.
     */
    ctx->sensor_raw_last = ctx->sensor_triggered();
    ctx->sensor_debounced = 0U;
    ctx->sensor_ready = 0U;
    ctx->sensor_change_tick = HAL_GetTick();
}


static void AxisHome_UpdateSensor(AxisHomeCtx_t *ctx)
{
    uint32_t now = HAL_GetTick();
    uint8_t raw = ctx->sensor_triggered();

    if (raw != ctx->sensor_raw_last)
    {
        ctx->sensor_raw_last = raw;
        ctx->sensor_change_tick = now;
        return;
    }

    if ((now - ctx->sensor_change_tick) < HOME_SENSOR_DEBOUNCE_MS)
    {
        return;
    }

    ctx->sensor_debounced = raw;
    ctx->sensor_ready = 1U;
}


static uint8_t AxisHome_SensorActive(
    const AxisHomeCtx_t *ctx)
{
    return ((ctx->sensor_ready != 0U) &&
            (ctx->sensor_debounced != 0U)) ? 1U : 0U;
}


/*
 * Start a fresh complete Home sequence.
 *
 * Vision MVP uses one deliberate KEY0 authorization and one complete Home
 * sequence per boot.  Repeated Home from CAMERA_READY is intentionally removed
 * from the main path so camera bring-up cannot accidentally retrigger homing.
 */
static uint8_t System_StartHome(void)
{
    if (Motion_IsBusy(home_x.motion) ||
        Motion_IsBusy(home_y.motion))
    {
        return 0U;
    }

    AxisHome_Init(
        &home_x,
        home_x.motion,
        X_HomeTriggered,
        X_HOME_DIR_SIGN);

    AxisHome_Init(
        &home_y,
        home_y.motion,
        Y_HomeTriggered,
        Y_HOME_DIR_SIGN);

    system_state = SYS_HOME_X;

    return 1U;
}


static uint8_t AxisHome_Task(
    AxisHomeCtx_t *ctx)
{
    MotionResultCode_t result;

    /*
     * Sample raw Home GPIO every ControlTask cycle, including while a motor
     * chunk is moving. State transitions below see only the debounced level.
     */
    AxisHome_UpdateSensor(ctx);

    if (ctx->sensor_ready == 0U)
    {
        return 0U;
    }

    if ((HAL_GetTick() - ctx->home_start_tick) >=
        HOME_AXIS_TIMEOUT_MS)
    {
        ctx->stage = HOME_STAGE_ERROR;
    }

    switch (ctx->stage)
    {
        case HOME_STAGE_FAST_START:

            /*
             * If already on Home at the beginning of this Home sequence,
             * release the switch first.
             *
             * This is also important for repeated Home.
             */
            if (AxisHome_SensorActive(ctx))
            {
                ctx->back_retry_count = 0U;
                ctx->stage = HOME_STAGE_BACK_START;
                break;
            }

            if ((int32_t)(HAL_GetTick() -
                          ctx->next_move_tick) < 0)
            {
                break;
            }

            if (Motion_StartHomeRelative(
                    ctx->motion,
                    ctx->dir_sign * HOME_FAST_STEP,
                    HOME_FAST_SPEED,
                    HOME_FAST_ACCEL,
                    1U))
            {
                ctx->stage = HOME_STAGE_FAST_WAIT;
            }

            break;


        case HOME_STAGE_FAST_WAIT:

            if (Motion_IsBusy(ctx->motion))
            {
                break;
            }

            /*
             * During FAST/SLOW search the Home sensor is the goal.
             * If the axis stopped early, stalled, timed out, or returned
             * STOPPED exactly on the sensor, reaching the sensor still means
             * this search leg succeeded. Only when the sensor is NOT active do
             * we interpret a non-OK Motion result as a real failure.
             *
             * BACK/RELEASE deliberately do NOT use this rule because those
             * phases are trying to leave the sensor.
             */
            if (AxisHome_SensorActive(ctx))
            {
                ctx->back_retry_count = 0U;
                ctx->next_move_tick =
                    HAL_GetTick() + HOME_INTER_MOVE_MS;
                ctx->stage = HOME_STAGE_BACK_START;
                break;
            }

            result = Motion_GetResult(ctx->motion);

            if (result != MOTION_RESULT_OK)
            {
                ctx->stage = HOME_STAGE_ERROR;
                break;
            }

            ctx->next_move_tick =
                HAL_GetTick() + HOME_INTER_MOVE_MS;
            ctx->stage = HOME_STAGE_FAST_START;
            break;


        case HOME_STAGE_BACK_START:

            if ((int32_t)(HAL_GetTick() -
                          ctx->next_move_tick) < 0)
            {
                break;
            }

