jingbaocheng/STM32_Motor_Control_Journey/07_Vision_XY_Integration/stm32/10_CAN_DualAxis_RTOS/Core/Src/system_control.c
            if (Motion_StartHomeRelative(
                    ctx->motion,
                    -ctx->dir_sign * HOME_BACK_STEP,
                    HOME_BACK_SPEED,
                    HOME_BACK_ACCEL,
                    0U))
            {
                ctx->stage = HOME_STAGE_BACK_WAIT;
            }

            break;


        case HOME_STAGE_BACK_WAIT:

            if (Motion_IsBusy(ctx->motion))
            {
                break;
            }

            result = Motion_GetResult(ctx->motion);

            if (result != MOTION_RESULT_OK)
            {
                ctx->stage = HOME_STAGE_ERROR;
                break;
            }

            ctx->next_move_tick =
                HAL_GetTick() + HOME_INTER_MOVE_MS;

            if (AxisHome_SensorActive(ctx))
            {
                ctx->back_retry_count++;

                if (ctx->back_retry_count >
                    HOME_BACK_MAX_RETRIES)
                {
                    ctx->stage = HOME_STAGE_ERROR;
                }
                else
                {
                    ctx->stage = HOME_STAGE_BACK_START;
                }
            }
            else
            {
                ctx->back_retry_count = 0U;
                ctx->stage = HOME_STAGE_SLOW_START;
            }

            break;


        case HOME_STAGE_SLOW_START:

            /*
             * If the sensor became active again before the slow approach
             * starts, release it again.
             */
            if (AxisHome_SensorActive(ctx))
            {
                ctx->stage = HOME_STAGE_BACK_START;
                break;
            }

            if ((int32_t)(HAL_GetTick() -
                          ctx->next_move_tick) < 0)
            {
                break;
            }

            if (Motion_StartHomeRelative(
                    ctx->motion,
                    ctx->dir_sign * HOME_SLOW_STEP,
                    HOME_SLOW_SPEED,
                    HOME_SLOW_ACCEL,
                    1U))
            {
                ctx->stage = HOME_STAGE_SLOW_WAIT;
            }

            break;


        case HOME_STAGE_SLOW_WAIT:

            if (Motion_IsBusy(ctx->motion))
            {
                break;
            }

            /*
             * Sensor-first semantics are intentional only for the two search
             * legs. Reaching Home is the successful outcome, even if the
             * Motion layer classified the way the motor stopped as STALL,
             * TIMEOUT or STOPPED.
             */
            if (AxisHome_SensorActive(ctx))
            {
                ctx->stable_start_tick = HAL_GetTick();
                ctx->stage = HOME_STAGE_STABLE_CONFIRM;
                break;
            }

            result = Motion_GetResult(ctx->motion);

            if (result != MOTION_RESULT_OK)
            {
                ctx->stage = HOME_STAGE_ERROR;
                break;
            }

            ctx->next_move_tick =
                HAL_GetTick() + HOME_INTER_MOVE_MS;
            ctx->stage = HOME_STAGE_SLOW_START;
            break;


        case HOME_STAGE_STABLE_CONFIRM:

            if (AxisHome_SensorActive(ctx))
            {
                if ((HAL_GetTick() -
                     ctx->stable_start_tick) >=
                    HOME_STABLE_CONFIRM_MS)
                {
                    /*
                     * Mechanical Home reference is confirmed here.
                     * Repeated Home will establish a new home_offset here.
                     */
                    if (Motion_SetZero(ctx->motion) == 0U)
                    {
                        /*
                         * Never continue Home with an invalid or stale zero.
                         * A bad home_offset would shift the entire machine
                         * coordinate system while still looking self-consistent.
                         */
                        ctx->stage = HOME_STAGE_ERROR;
                        break;
                    }

                    ctx->release_retry_count = 0U;

                    ctx->next_move_tick =
                        HAL_GetTick() + HOME_INTER_MOVE_MS;

                    ctx->stage =
                        HOME_STAGE_RELEASE_START;
                }
            }
            else
            {
                /*
                 * Home signal disappeared before the confirmation time.
                 * Treat it as unstable and approach slowly again.
                 */
                ctx->stable_start_tick = 0U;

                ctx->next_move_tick =
                    HAL_GetTick() + HOME_INTER_MOVE_MS;

                ctx->stage = HOME_STAGE_SLOW_START;
            }

            break;


        case HOME_STAGE_RELEASE_START:

            if ((int32_t)(HAL_GetTick() -
                          ctx->next_move_tick) < 0)
            {
                break;
            }

            /*
             * Home direction is +dir_sign.
             * Release direction is therefore -dir_sign.
             */
            if (Motion_StartHomeRelative(
                    ctx->motion,
                    -ctx->dir_sign * HOME_RELEASE_STEP,
                    HOME_RELEASE_SPEED,
                    HOME_RELEASE_ACCEL,
                    0U))
            {
                ctx->stage =
                    HOME_STAGE_RELEASE_WAIT;
            }

            break;


        case HOME_STAGE_RELEASE_WAIT:

            if (Motion_IsBusy(ctx->motion))
            {
                break;
            }

            result = Motion_GetResult(ctx->motion);

            if (result != MOTION_RESULT_OK)
            {
                ctx->stage = HOME_STAGE_ERROR;
                break;
            }

            /*
             * The release move has finished.
             * Now confirm that the Home sensor remains released.
             */
            ctx->stable_start_tick = HAL_GetTick();

            ctx->stage =
                HOME_STAGE_RELEASE_CONFIRM;

            break;


