jingbaocheng/STM32_Motor_Control_Journey/07_Vision_XY_Integration/stm32/10_CAN_DualAxis_RTOS/Core/Src/system_control.c
        case HOME_STAGE_RELEASE_CONFIRM:

            if (!AxisHome_SensorActive(ctx))
            {
                if (ctx->stable_start_tick == 0U)
                {
                    ctx->stable_start_tick =
                        HAL_GetTick();
                }

                if ((HAL_GetTick() -
                     ctx->stable_start_tick) >=
                    HOME_STABLE_CONFIRM_MS)
                {
                    ctx->stage =
                        HOME_STAGE_DONE;
                }
            }
            else
            {
                /*
                 * 2048 counts was not enough to leave the active window.
                 * Retry RELEASE instead of waiting motionless for 180 s.
                 */
                ctx->stable_start_tick = 0U;
                ctx->release_retry_count++;

                if (ctx->release_retry_count >
                    HOME_RELEASE_MAX_RETRIES)
                {
                    ctx->stage = HOME_STAGE_ERROR;
                }
                else
                {
                    ctx->next_move_tick =
                        HAL_GetTick() + HOME_INTER_MOVE_MS;
                    ctx->stage = HOME_STAGE_RELEASE_START;
                }
            }

            break;


        case HOME_STAGE_DONE:
        case HOME_STAGE_ERROR:
        default:
            break;
    }

    return ((ctx->stage == HOME_STAGE_DONE) ||
            (ctx->stage == HOME_STAGE_ERROR)) ? 1U : 0U;
}


void System_Init(
    MotionController_t *motion_x,
    MotionController_t *motion_y)
{
    AxisHome_Init(
        &home_x,
        motion_x,
        X_HomeTriggered,
        X_HOME_DIR_SIGN);

    AxisHome_Init(
        &home_y,
        motion_y,
        Y_HomeTriggered,
        Y_HOME_DIR_SIGN);

    Motion_SetPollingEnabled(home_x.motion, 1U);
    Motion_SetPollingEnabled(home_y.motion, 1U);

    Key0_ResetHold();

    /*
     * Camera trigger idle state: HIGH.
     * Previous standalone hardware test confirmed:
     * PB0 LOW -> optocoupler O1 rises -> camera trigger.
     */
    HAL_GPIO_WritePin(
        CAMERA_TRIG_GPIO_Port,
        CAMERA_TRIG_Pin,
        GPIO_PIN_SET);

    g_key0_start_count = 0U;
    g_camera_ready = 0U;
    g_debug_home_request = 0U;
    g_camera_trigger_request = 0U;
    g_camera_move_request = 0U;
    g_system_error_from_state = SYS_STARTUP;
    g_home_x_stage = home_x.stage;
    g_home_y_stage = home_y.stage;
    g_camera_ready_y_enable = CAMERA_READY_Y_ENABLE_DEFAULT;
    g_camera_ready_x_target = CAMERA_READY_X_DEFAULT;
    g_camera_ready_y_target = CAMERA_READY_Y_DEFAULT;
    g_camera_ready_x_actual = 0;
    g_camera_ready_y_actual = 0;

    system_state = SYS_STARTUP;
    system_state_tick = HAL_GetTick();
     
}


SystemState_t System_GetState(void)
{
    return system_state;
}


uint8_t System_IsCameraReady(void)
{
    return g_camera_ready;
}


void System_Task(void)
{
    /* Always expose current machine positions to Watch / future comm layer. */
    g_camera_ready_x_actual =
        Motion_GetMachinePosition(home_x.motion);

    g_camera_ready_y_actual =
        Motion_GetMachinePosition(home_y.motion);

    g_home_x_stage = home_x.stage;
    g_home_y_stage = home_y.stage;

    switch (system_state)
    {
        case SYS_STARTUP:
        {
            HAL_StatusTypeDef x_status = HAL_OK;
            HAL_StatusTypeDef y_status = HAL_OK;

            g_camera_ready = 0U;

            if (home_x.motion->motor->is_enabled == 0U)
            {
                x_status = MKS_Set_Enable_State(
                    home_x.motion->motor,
                    1U);
            }

            if (home_y.motion->motor->is_enabled == 0U)
            {
                y_status = MKS_Set_Enable_State(
                    home_y.motion->motor,
                    1U);
            }

            if (((x_status != HAL_OK) &&
                 (x_status != HAL_BUSY)) ||
                ((y_status != HAL_OK) &&
                 (y_status != HAL_BUSY)))
            {
                System_EnterError();
                break;
            }

            if ((home_x.motion->motor->is_enabled != 0U) &&
                (home_y.motion->motor->is_enabled != 0U))
            {
                system_state_tick = HAL_GetTick();
                Key0_ResetHold();
                system_state = SYS_WAIT_ENABLE;
                break;
            }

            /*
             * HAL_BUSY is retryable, but startup is never allowed to wait
             * forever on a saturated CAN TX path.
             */
            if ((HAL_GetTick() - system_state_tick) >=
                CONTROL_ENABLE_TX_TIMEOUT_MS)
            {
                System_EnterError();
            }

            break;
        }


        case SYS_WAIT_ENABLE:

            /*
             * The enable frames being queued is not proof that either driver
             * is alive. During the 3 s settle window Motion_Task polls 0x31.
             * At the end, require fresh replies from BOTH axes before allowing
             * Home. A disconnected/unpowered CAN node therefore becomes an
             * explicit SYS_ERROR instead of a later mysterious Home failure.
             */
            if ((HAL_GetTick() - system_state_tick) >=
                CONTROL_ENABLE_SETTLE_MS)
            {
                if ((Motion_PositionIsFresh(home_x.motion) == 0U) ||
                    (Motion_PositionIsFresh(home_y.motion) == 0U))
                {
                    System_EnterError();
                }
                else
                {
                    Key0_ResetHold();
                    system_state = SYS_WAIT_HOME_KEY;
                }
            }
            break;


        case SYS_WAIT_HOME_KEY:

            /*
             * Communication that was healthy at startup must remain healthy.
             * This also prevents the three auto-retransmitting TX mailboxes
             * from staying permanently saturated if the CAN link disappears
             * while the operator is waiting to press KEY0.
             */
            if ((Motion_PositionIsFresh(home_x.motion) == 0U) ||
                (Motion_PositionIsFresh(home_y.motion) == 0U))
            {
                System_EnterError();
                break;
            }

