jingbaocheng/STM32_Motor_Control_Journey/07_Vision_XY_Integration/stm32/10_CAN_DualAxis_RTOS/Core/Src/system_control.c
            /*
             * Normal path: one physical KEY0 press held for ~50 ms.
             * Debug escape hatch: set g_debug_home_request=1 in Watch if the
             * laboratory button ever blocks progress.  This is intentionally
             * NOT a second motion owner; it is consumed here by ControlTask.
             */
            if ((g_debug_home_request != 0U) ||
                (Key0_HoldStartRequested() != 0U))
            {
                g_debug_home_request = 0U;
                Key0_ResetHold();

                if (!System_StartHome())
                {
                    System_EnterError();
                }
            }
            break;


        case SYS_HOME_X:

            if (AxisHome_Task(&home_x))
            {
                if (home_x.stage == HOME_STAGE_DONE)
                {
                    /* Y timeout starts only when Y actually begins. */
                    home_y.home_start_tick = HAL_GetTick();
                    system_state = SYS_HOME_Y;
                }
                else
                {
                    System_EnterError();
                }
            }
            break;


        case SYS_HOME_Y:

            if (AxisHome_Task(&home_y))
            {
                if (home_y.stage == HOME_STAGE_DONE)
                {
                    system_state = SYS_HOME_DONE;
                }
                else
                {
                    System_EnterError();
                }
            }
            break;


        case SYS_HOME_DONE:

            /*
             * Home is now infrastructure, not the experiment.
             * Immediately transition to the camera working position.
             */
            system_state = SYS_MOVE_CAMERA_X_START;
            break;


        case SYS_MOVE_CAMERA_X_START:

            if (Camera_TargetAlreadyReached(
                    home_x.motion,
                    g_camera_ready_x_target))
            {
                if (g_camera_ready_y_enable != 0U)
                {
                    system_state = SYS_MOVE_CAMERA_Y_START;
                }
                else
                {
                   System_StartCameraSettle();
                }
            }
            else if (Motion_StartAbsoluteMachine(
                         home_x.motion,
                         g_camera_ready_x_target,
                         CAMERA_READY_SPEED,
                         CAMERA_READY_ACCEL))
            {
                system_state = SYS_MOVE_CAMERA_X_WAIT;
            }
            else
            {
                System_EnterError();
            }
            break;


        case SYS_MOVE_CAMERA_X_WAIT:

            if (!Motion_IsBusy(home_x.motion))
            {
                if (Motion_GetResult(home_x.motion) == MOTION_RESULT_OK)
                {
                    if (!Camera_TargetWithin(
                            home_x.motion,
                            g_camera_ready_x_target,
                            CAMERA_READY_VERIFY_TOLERANCE))
                    {
                        System_EnterError();
                    }
                    else if (g_camera_ready_y_enable != 0U)
                    {
                        system_state = SYS_MOVE_CAMERA_Y_START;
                    }
                    else
                    {
                        System_StartCameraSettle();
                    }
                }
                else
                {
                    System_EnterError();
                }
            }
            break;


        case SYS_MOVE_CAMERA_Y_START:

            if (Camera_TargetAlreadyReached(
                    home_y.motion,
                    g_camera_ready_y_target))
            {
                System_StartCameraSettle();
            }
            else if (Motion_StartAbsoluteMachine(
                         home_y.motion,
                         g_camera_ready_y_target,
                         CAMERA_READY_SPEED,
                         CAMERA_READY_ACCEL))
            {
                system_state = SYS_MOVE_CAMERA_Y_WAIT;
            }
            else
            {
                System_EnterError();
            }
            break;


        case SYS_MOVE_CAMERA_Y_WAIT:

            if (!Motion_IsBusy(home_y.motion))
            {
                if (Motion_GetResult(home_y.motion) == MOTION_RESULT_OK)
                {
                    if (!Camera_TargetWithin(
                            home_y.motion,
                            g_camera_ready_y_target,
                            CAMERA_READY_VERIFY_TOLERANCE))
                    {
                        System_EnterError();
                    }
                    else
                    {
                        System_StartCameraSettle();
                    }
                }
                else
                {
                    System_EnterError();
                }
            }
            break;


        case SYS_CAMERA_SETTLE:

                /*
                 * Allow the stage / target / camera image to settle
                 * before issuing the hardware trigger.
                 */
                if ((HAL_GetTick() - system_state_tick) >=
                    CAMERA_SETTLE_MS)
                {
                    if (Camera_AllTargetsVerified() == 0U)
                    {
                        System_EnterError();
                    }
                    else
                    {
                        system_state = SYS_CAMERA_TRIGGER_START;
                    }
                }

                break;

        case SYS_CAMERA_TRIGGER_START:

            /*
             * Previous standalone hardware test confirmed:
             *
             * PB0 HIGH -> optocoupler output O1 ~= 0 V  (idle)
             * PB0 LOW  -> optocoupler output O1 rises   (camera trigger)
             *
             * MVS is configured for Line0 Rising Edge.
             * Therefore pulling PB0 LOW starts one camera trigger.
             */
            g_camera_ready = 0U;

            HAL_GPIO_WritePin(
                CAMERA_TRIG_GPIO_Port,
                CAMERA_TRIG_Pin,
                GPIO_PIN_RESET);

