jingbaocheng/STM32_Motor_Control_Journey/07_Vision_XY_Integration/stm32/10_CAN_DualAxis_RTOS/Core/Src/system_control.c
            system_state_tick = HAL_GetTick();
            system_state = SYS_CAMERA_TRIGGER_WAIT;
            break;


        case SYS_CAMERA_TRIGGER_WAIT:

            /*
             * Non-blocking 10 ms active-low pulse.
             * System_Task is serviced periodically by the existing ControlTask.
             */
            if ((HAL_GetTick() - system_state_tick) >=
                CAMERA_TRIGGER_PULSE_MS)
            {
                HAL_GPIO_WritePin(
                    CAMERA_TRIG_GPIO_Port,
                    CAMERA_TRIG_Pin,
                    GPIO_PIN_SET);

                g_camera_ready = 1U;
                system_state = SYS_CAMERA_READY;
            }
            break;

        case SYS_CAMERA_READY:

            /*
             * A move request has priority over ready-position verification.
             *
             * Reason: laboratory tuning / future vision control may update
             * g_camera_ready_*_target and g_camera_move_request together.
             * If we compared the current position against the NEW target first,
             * the system would enter SYS_ERROR before it had a chance to move.
             */
            if (g_camera_move_request != 0U)
            {
                g_camera_move_request = 0U;
                g_camera_ready = 0U;
                system_state = SYS_MOVE_CAMERA_X_START;
                break;
            }

            /*
             * Without a move request, CAMERA_READY remains valid only while
             * the current target is in tolerance and encoder feedback is fresh.
             */
            if (Camera_AllTargetsVerified() == 0U)
            {
                System_EnterError();
                break;
            }

            g_camera_ready = 1U;

            /*
             * Pure camera repeatability test:
             * trigger another frame without commanding X/Y motion.
             */
            if (g_camera_trigger_request != 0U)
            {
                g_camera_trigger_request = 0U;
                g_camera_ready = 0U;
                system_state = SYS_CAMERA_TRIGGER_START;
            }

            break;

        case SYS_ERROR:

            g_camera_ready = 0U;
            /* Terminal error for this boot: no automatic movement. */
            break;


        default:

            g_camera_ready = 0U;
            System_EnterError();
            break;
    }
}
